lfazio/rv32cortex-m/src/platform/stm32f746/main.c
static void irq_line_entry(IRQn_Type irqn)
{
    NVIC_DisableIRQ(irqn);
    emu_core_set_irq(&g_core, (uint32_t)irqn, true);
}

void emu_board_irq_unmask(void *ctx, uint32_t source)
{
    (void)ctx;
    if (irq_is_bridged(source)) {
        NVIC_ClearPendingIRQ((IRQn_Type)source);
        NVIC_EnableIRQ((IRQn_Type)source);
    }
}

/*
 * Enable the bridged lines at the NVIC. Priority is left at the default:
 * these handlers do almost nothing, and the emulator has no other interrupt
 * to rank them against.
 */
void emu_board_irqs_init(void)
{
    for (unsigned i = 0; i < sizeof(g_bridged) / sizeof(g_bridged[0]); i++) {
        NVIC_EnableIRQ(g_bridged[i]);
    }
}

void TIM6_DAC_IRQHandler(void)
{
    irq_line_entry(TIM6_DAC_IRQn);
}

/*
 * Where the guest image currently lives. Initialised to the copy
 * guest_image.S baked into the firmware, and repointed at the flash
 * arena when one arrives over TFTP.
 *
 * These exist because build_address_space() used to read the .incbin
 * symbols directly, which made "which image is running" a link-time
 * fact. An upload has to be able to change it at run time.
 */
static const uint8_t *g_img      = emu_guest_image;
static uint32_t       g_img_size;
static bool start_guest(void);

/* ------------------------------------------------------------------ */
/* What this board owes the shared runner (see emu_board.h)            */
/* ------------------------------------------------------------------ */

/*
 * Guest time, from the cycle counter. The divisor is fixed at start-up
 * because SystemCoreClock is, and the epoch is the first slice rather
 * than reset so a guest's clock starts near zero.
 */
static uint32_t g_cycles_per_tick;
static uint32_t g_start_cycles;

uint64_t emu_board_time_now(void)
{
    return (uint64_t)(board_cycles() - g_start_cycles) / g_cycles_per_tick;
}

const char *const emu_board_core_name = "Cortex-M7";

/*
 * Mutable, because this board *can* be reloaded: an image arriving over
 * TFTP or through gdb's `load` moves these, and the address space is
 * rebuilt around the new numbers.
 */
const uint8_t *emu_board_img      = NULL;
uint32_t       emu_board_img_size = 0u;

uint8_t *emu_board_ram      = NULL;
uint32_t emu_board_ram_size = 0u;

/*
 * The passthrough windows. Identity-mapped, so a guest driver writing
 * what its datasheet says reaches the real peripheral -- the point of
 * this emulator, and necessarily per-part.
 */
bool emu_board_add_regions(emu_bus_t *bus)
{
    for (unsigned i = 0; i < sizeof(g_periph_map) / sizeof(g_periph_map[0]);
         i++) {
        if (!emu_bus_add_passthru(bus, g_periph_map[i].name,
                                  g_periph_map[i].base,
                                  g_periph_map[i].size,
                                  (uintptr_t)g_periph_map[i].base,
                                  g_periph_map[i].perm, EMU_WANY)) {
            return false;
        }
    }
    return true;
}

/* The board's view of the image, refreshed before every rebuild. */
static void publish_image(void)
{
    emu_board_img      = g_img;
    emu_board_img_size = g_img_size;
    emu_board_ram      = GUEST_RAM_BASE_PTR;
    emu_board_ram_size = GUEST_RAM_SIZE;
}


/*
 * Everything that has to be redone when the guest image changes:
 * rebuild the bus from the image's two halves, put the writable half
 * where the guest expects it, and reset the core.
 *
 * Split out of main() because an upload has to repeat it. The address
 * space is torn down and rebuilt rather than patched, because the
 * read-only region's base and length both move when a different image
 * arrives and emu_bus has no way to resize a region in place.
 */

static bool start_guest(void)
{
    publish_image();
    return emu_start_guest(&g_core, &g_bus, &g_uart, &g_exit);
}

#if EMU_NET
/* ------------------------------------------------------------------ */
/* Images arriving over TFTP                                           */
/* ------------------------------------------------------------------ */

/*
 * The emulator is already suspended whenever these run: they are reached
 * from emu_net_poll(), which the run loop calls between guest slices, so
 * no guest instruction is in flight. Nothing has to be stopped -- but
 * the restart does have to be explicit, because the bus regions and the
 * reset vector were built from the old image.
 */
/*
 * Both halves land in the flash arena, back to back, and the guest is
 * restarted only when the second arrives.
 *
 * The writable half cannot go straight into guest RAM, which is the
 * obvious thing and is wrong: start_guest() clears RAM beyond the image
 * -- deliberately, so that one test cannot pass on state another wrote
 * -- and it is start_guest() that the upload calls. The .data written
 * during the transfer was being zeroed by the reload it triggered.
 * Nothing would have reported it: the check is "did the guest run", and
 * it does, with every initialised variable set to zero. Two of the three
 * guests in the tree have an empty .rw, so the obvious thing to test it
 * with cannot see it either.
 *
 * Keeping both halves in flash also makes the arrangement identical to
 * the baked-in image -- one blob, split at g_img_ro -- so start_guest()
 * needs no case for where the image came from, and a reset re-runs the
 * uploaded guest rather than reverting to the built-in one.
 *
 * Hence the contract: upload `rom`, then `ram`. The ram half is the
 * commit point, because it is the one that completes an image; a guest
 * with no .data uploads an empty one to say so. Committing on the rom
 * half instead would restart the guest with the *previous* image's
 * .data, print a whole run's worth of output from it, and only then be
 * corrected -- and a harness reading the console cannot tell that first
 * summary from the real one.
 */
static uint32_t g_up_addr;      /* where the rom half is being written  */
static bool     g_reload;

bool emu_net_image_begin(void)
{
    g_up_addr = board_flash_arena_begin();
    return g_up_addr != 0u;
}

bool emu_net_image_data(const void *data, uint32_t len, uint32_t off)
{
    return board_flash_write(g_up_addr + off, data, len);
}

