lfazio/rv32cortex-m/src/platform/stm32f746/main.c
    /*
     * Now that there is a core to hang them off, put the frontend's own
     * devices on the bus and start. start_guest() does both, because a
     * reload has to do both -- see the note on it.
     */
    if (!start_guest()) {
        console_printf("fatal: could not start the guest\n");
        fatal_halt();
    }

    /*
     * Everything from here down is one run of one guest, and an uploaded
     * image comes back to it. The banner is inside the loop deliberately:
     * it names the image's size, which is the first thing that differs
     * after a reload and the first thing a harness wants to see.
     */
restart:
    console_printf("guest  %u bytes at 0x%08x\n"
                   "ram    %u KiB (%u bytes)\nbackend ",
                   (unsigned)g_img_size, (unsigned)EMU_GUEST_RESET_PC,
                   (unsigned)(GUEST_RAM_SIZE / 1024u),
                   (unsigned)GUEST_RAM_SIZE);

    emu_cpu_status_t st;
    emu_core_status(&g_core, &st);
    console_printf("%s\n\n", st.backend);

    g_cycles_per_tick = SystemCoreClock / EMU_TIMER_HZ;
    const uint32_t start_cycles = board_cycles();

    g_start_cycles = start_cycles;
    uint64_t retired_total = 0;

    bool capped = false;

    {
        const emu_run_env_t env = {
            .slice       = EMU_RUN_SLICE,
            .max_insn    = EMU_MAX_INSN,
#if EMU_NET
            .take_upload = take_uploaded_image,
#else
            .take_upload = NULL,
#endif
        };
        const emu_run_outcome_t out =
            emu_run_guest(&g_core, ops, &env, &retired_total);

        if (out == EMU_RUN_OUTCOME_RELOAD) {
            goto restart;
        }
        capped = (out == EMU_RUN_OUTCOME_CAPPED);
    }

    const uint32_t elapsed = board_cycles() - start_cycles;

    if (capped) {
        /*
         * Named on its own line and before the statistics, so a harness
         * reading the console can tell "did not terminate" from "ran and
         * failed" without parsing the numbers.
         */
        console_printf("\nemu: instruction cap reached, guest did not halt\n");
    }

    emu_print_run_summary(retired_total, elapsed);
    if (retired_total != 0u) {
        /* KIPS needs the core clock, which is the platform's to know. */
        const uint32_t kips =
            (uint32_t)((uint64_t)retired_total * (SystemCoreClock / 1000u) / elapsed);
        console_printf("  speed    %u KIPS\n", (unsigned)kips);
    }

    /*
     * **These are the framework's, not a frontend's**, and this used to
     * say the opposite -- "the one place in this file that names a
     * frontend, and unavoidably so". It was avoidable: emu_jit_get_stats
     * reports blocks, translations, entries, fallbacks, flushes,
     * compactions, evictions, code use and the declined/overflow split
     * for *any* frontend on *any* host, because the dispatch loop that
     * maintains them is shared. Reading them through rv_jit_get_stats
     * meant a G4MH firmware -- which has a Thumb-2 JIT and uses it --
     * printed no statistics at all, so the one number that says whether
     * translation is being exercised was missing from exactly the
     * frontend with no reference model to fall back on.
     */
    /*
     * No #if. emu_print_jit_stats answers "is there a JIT here" from the
     * framework's own code_size, so the caller needs no capability macro
     * -- and the one that was here read EMU_HAVE_JIT without including
     * what defines it, which #if treats as 0 without a word. The whole
     * block silently stopped printing the moment an unrelated include was
     * removed.
     */
    (void)emu_print_jit_stats();

    emu_report_state(g_core.cpu, g_core.ops);

#if EMU_NET
    /*
     * Bytes the wire delivered and nothing collected. Reported next to
     * the guest's own numbers because it is the one failure that makes
     * *those* numbers untrustworthy without looking wrong: a dropped
     * byte is a dropped SLIP frame, which is a retransmission at best
     * and a truncated image at worst.
     */
    console_printf("\n-- net --\n  rx drops %u",
                   (unsigned)board_console_rx_overruns());
    /*
     * How often the TFTP server had to be rebuilt under it. Nonzero is
     * normal -- the watchdog re-arms while the link is quiet -- but it
     * climbing during a suite run means transfers are being abandoned,
     *  is worth seeing rather than inferring from a slow harness.
     */
    console_printf("  tftp reclaims %u\n",
                   (unsigned)emu_net_tftp_reclaims());
#endif

    /*
     * The machine-readable terminator, and deliberately the last thing
     * printed for a run.
     *
     * A harness needs two things this report otherwise does not give it:
     * where the output for this guest *ends* -- there is no process to
     * exit, so nothing else says so -- and the guest's exit status,
     *  both test suites judge on and  was being captured and
     * then thrown away. run-riscv-tests.sh reads the runner's exit code
     * as (testnum << 1) | 1, so losing it means every result is "it ran".
     *
     * `exited` distinguishes a guest that called exit() from one that
     * halted or was capped, because exit=0 means nothing if the guest
     * never reached the syscall.
     */
    console_printf("\nemu-result exit=%u exited=%u capped=%u retired=%u\n",
                   (unsigned)g_exit.code, (unsigned)(g_exit.exited ? 1u : 0u),
                   (unsigned)(capped ? 1u : 0u), (unsigned)retired_total);

    for (;;) {
#if EMU_NET
        /*
         * Everything above is still sitting in the output ring: the run
         * loop stopped, and with it the only thing that was delivering.
         * Parking in __WFI without draining first would lose the entire
         * report -- which is the part a harness came for.
         *
         * __WFI is still right rather than a busy loop. The UART receive
         * interrupt is what wakes it, and that fires on the first byte
         * of anything the host sends, including the ACK for what is
         * being flushed here.
         */
        emu_net_poll();

