lfazio/rv32cortex-m/src/platform/stm32f746/main.c
        /*
         * An image may arrive after the guest has finished, and that is
         * the *normal* case rather than an edge one: a harness runs a
         * test, waits for it to halt and report, then pushes the next.
         * The reload check inside the run loop above never sees those,
         * because that loop exited when the guest halted -- so an upload
         * completed successfully, said so, and nothing happened.
         *
         * Jumping back to the top of the run is what makes the board a
         * server for the whole suite instead of a one-shot. `goto`
         * rather than wrapping the run in a function: everything it
         * needs is already local to main(), and a loop around all of it
         * would indent the entire body to say the same thing.
         */
        if (take_uploaded_image()) {
            goto restart;
        }

        /*
         * Run control still works after the guest has finished.
         *
         * Without this the park loop services the network and nothing
         * else, so a debugger attaching to a completed run can read
         * registers and memory and then hangs the moment it resumes:
         * `continue` is accepted, nothing executes, and gdb waits
         * forever. That is the normal way to arrive here -- push an
         * image, watch it fail, attach to find out why -- and being
         * able to rewind the pc and re-run under a breakpoint is most
         * of what that is for.
         *
         * __WFI is skipped while a debugger is driving, because the
         * thing that would wake it is the guest's own interrupt and
         * there may not be one.
         */
        if (emu_net_gdb_attached()) {
            uint32_t n = 0;

            (void)emu_net_gdb_run(EMU_RUN_SLICE, &n);
            continue;
        }

        /*
         * Do not sleep while the stack is up, and the reason is the
         * clock rather than latency.
         *
         * lwIP's time base is sys_now(), which is derived from
         * board_cycles() -- DWT CYCCNT, a counter of *processor* cycles.
         * __WFI stops the processor clock, so CYCCNT stops with it and
         * the stack's notion of time stops advancing. Measured here:
         * over 29 seconds of wall time parked in this loop, lwIP's clock
         * advanced 1.74 seconds, about 6% of real time.
         *
         * Every timeout in the stack is frozen by that, not just one.
         * The visible symptom was TFTP: a client killed mid-transfer
         * leaves a session open, and the 10-second timeout that would
         * reclaim it needs ~3 minutes of wall time to expire, so in
         * practice the board refused every later upload until it was
         * reset. Anything else time-based -- a TCP retransmission, an
         * ARP entry ageing out -- is slowed by the same factor, and
         * would present as a link that is mysteriously sluggish rather
         * than as a stopped clock.
         *
         * Nothing here is a power-sensitive workload: this loop is a
         * bench board waiting to be handed the next test image. Polling
         * costs nothing that matters and keeps the clock honest. The
         * board still sleeps when the network is *not* up, which is the
         * plain serial-console case where nothing depends on lwIP's
         * timers at all.
         *
         * Fixing it in the time base instead would mean a free-running
         * peripheral timer -- a TIM keeps its clock through Sleep where
         * CYCCNT does not -- which is the better answer if this loop
         * ever needs to sleep again.
         */
        if (emu_net_active()) {
            continue;
        }
#endif
        __WFI();
    }
}
